<?xml version="1.0" ?>
<net name="best" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,640,640"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Slice_4/Cast_116666_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Slice_4/Cast_216668_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Slice_4/Cast_316670_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_9/Cast_116614_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Slice_9/Cast_216616_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Slice_9/Cast_316618_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_9" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Slice_14/Cast_116646_const" type="Const" version="opset1">
			<data element_type="i64" offset="160" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Slice_14/Cast_216648_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Slice_14/Cast_316650_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Slice_19/Cast_116674_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Slice_19/Cast_216676_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Slice_19/Cast_316678_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Slice_19" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Slice_24/Cast_116660_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_24/Cast_216662_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_24/Cast_316664_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_24" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_29/Cast_116652_const" type="Const" version="opset1">
			<data element_type="i64" offset="192" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_29/Cast_216654_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Slice_29/Cast_316656_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Slice_29" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,0" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Slice_34/Cast_116640_const" type="Const" version="opset1">
			<data element_type="i64" offset="160" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_34/Cast_216642_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_34/Cast_316644_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_34" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Slice_39/Cast_116604_const" type="Const" version="opset1">
			<data element_type="i64" offset="192" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Slice_39/Cast_216606_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Slice_39/Cast_316608_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Slice_39" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,0" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Concat_40" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="onnx_initializer_node_model.0.conv.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="224" shape="32,12,3,3" size="13824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_41/Dims5441/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="14048" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_41" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx_initializer_node_model.1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="14176" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_43/Dims5273/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="87904" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_43" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx_initializer_node_model.2.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="88160" shape="32,64,1,1" size="8192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_45/Dims5297/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="96352" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_45" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Relu_46" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx_initializer_node_model.2.m.0.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="96480" shape="32,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_47/Dims5399/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="100576" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_47" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Relu_48" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx_initializer_node_model.2.m.0.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="100704" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_49/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_49/Dims5315/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="137568" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_49" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Relu_50" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Add_51" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx_initializer_node_model.2.cv3.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="137696" shape="32,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_52" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="onnx_initializer_node_model.2.cv2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="141792" shape="32,64,1,1" size="8192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_53" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_54" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_mul_8198/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="149984" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="BatchNormalization_55/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_8200/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="150240" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="BatchNormalization_55/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="LeakyRelu_5612811/Cast_116610_const" type="Const" version="opset1">
			<data element_type="f32" offset="150496" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="LeakyRelu_5612811" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx_initializer_node_model.2.cv4.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="150500" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_57/Dims5255/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="166884" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_57" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Relu_58" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="onnx_initializer_node_model.3.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="167140" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_59/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_59/Dims5471/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="462052" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_59" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Relu_60" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="onnx_initializer_node_model.4.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="462564" shape="64,128,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_61/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_61/Dims5447/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="495332" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_61" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Relu_62" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="onnx_initializer_node_model.4.m.0.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="495588" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_63/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_63/Dims5423/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="511972" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_63" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Relu_64" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx_initializer_node_model.4.m.0.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="512228" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_65/Dims5465/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="659684" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_65" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Relu_66" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Add_67" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx_initializer_node_model.4.m.1.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="659940" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_68/Dims5279/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="676324" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_68" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_69" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="onnx_initializer_node_model.4.m.1.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="676580" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_70/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_70/Dims5333/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="824036" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_70" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Relu_71" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Add_72" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="onnx_initializer_node_model.4.m.2.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="824292" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_73/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_73/Dims5177/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="840676" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_73" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Relu_74" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="onnx_initializer_node_model.4.m.2.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="840932" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_75/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_75/Dims5261/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="988388" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_75" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu_76" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Add_77" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="onnx_initializer_node_model.4.cv3.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="988644" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_78" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="onnx_initializer_node_model.4.cv2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1005028" shape="64,128,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_79" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Concat_80" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="data_mul_82028206/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1037796" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="BatchNormalization_81/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
